schemas/src/main/resources/ogc/sos/2.0/examples/SOAP/GetObservation1_SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--=====================================================================
Example SOAP Request GetObservation operation which contains filters for offering, observedProperty and the phenomenonTime. The response contains observations for the observed property and with phenomenonTime matching the temporalFilter.
=======================================================================-->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd
http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:ogc="http://www.opengis.net/ogc" xmlns:om="http://www.opengis.net/om/1.0">
	<soap12:Header>
		<wsa:To>http://www.ogc.org/SOS</wsa:To>
		<wsa:Action>http://www.opengis.net/def/serviceOperation/sos/core/2.0/GetObservation</wsa:Action>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:MessageID>http://my.client.com/uid/msg-0010</wsa:MessageID>
	</soap12:Header>
	<soap12:Body>
		<sos:GetObservation service="SOS" version="2.0.0">
			<!--identifier of an offering-->
			<sos:offering>http://www.my_namespace.org/water_gage_1_observations</sos:offering>
			<!--identifier of an observed property-->
			<sos:observedProperty>http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#WaterHeight</sos:observedProperty>
			<!--optional temporal filter restricting the results which shall be returned-->
			<sos:temporalFilter>
				<fes:After>
					<fes:ValueReference>phenomenonTime</fes:ValueReference>
					<gml:TimeInstant gml:id="startPosition">
						<gml:timePosition>2008-03-01T17:44:15.000+00:00</gml:timePosition>
					</gml:TimeInstant>
				</fes:After>
			</sos:temporalFilter>
		</sos:GetObservation>
	</soap12:Body>
</soap12:Envelope>
